[
  {
    "id": "1753449794995",
    "title": "Is AI a Threat to Job Security",
    "category": "Technology",
    "videoUrl": "",
    "content": "<p><strong>AI and Job Security: Will University Graduates Thrive Or Merely Survive?</strong></p><p class=\"ql-align-justify\">&nbsp;</p><p class=\"ql-align-justify\">In a world where Artificial Intelligence (AI) is quickly transforming how we work, live, think, and even interact with others is overwhelming, no wonder university graduates are questioning their place in the job market. Once upon a time, a degree meant a direct ticket to securing stable employment and upward mobility; today, the rules have changed immensely. </p><p class=\"ql-align-justify\">For instance, AI is not just the smart tech behind most of our electronic gadgets like laptops, smartphone,s etc. that we use, it’s now used to analyse legal characters, test if printed documents are AI-generated, and also can be used to write news articles and feature stories just like a human can do or even better. From hospitals to boardrooms, AI is weaving itself into the fabric of industries, sparking both amazement and anxiety. For recent graduates, this raises an unsettling question: If machines are doing the work we are trained for, what’s left for us?</p><p class=\"ql-align-justify\">Journalism students are not finding it any easier; nowadays, media houses use AI tools to generate news articles. This makes the journalism students feel like their creativity is being sidelined. University lectures on AI tools to monitor exam cheating among students and ensure that the essays presented have AI text.</p><p class=\"ql-align-justify\">The traditional university degree used to assure and safeguard careers, but in today’s AI-driven world, a degree is no longer enough. Industries are now demanding more than theoretical knowledge—they are looking for tech-savvy graduates who can adapt, problem-solve, and think critically. Consider Ian, an accounting graduate from Maseno University. He found himself competing with AI-powered software that could process financial data faster and more accurately than any human could. Instead of giving up, Ian enrolled in a data analytics course and now works as a financial analyst, using AI tools to enhance his work rather than replace it.</p><p class=\"ql-align-justify\">Some universities are stepping up to the challenge by introducing interdisciplinary programs. This university sends computer science, AI ethics, and hands-on problem solving to prepare students for a hybrid future where humans and machines work side-by-side. The truth of the matter is that changes like these will require time to be fully implemented. </p><p class=\"ql-align-justify\">Even though, proving to be a threat, taking over jobs meant for graduates, it is also providing and creating exciting opportunities. Someone can be tasked to design algorithms for ethical AI or lead teams that integrate human creativity with machine precision example, Maria is a graduate from one of the universities here in Kenya. She's in the field of AI ethics, and her role is to ensure that AI systems are designed to be fair and unbiased. The key to staying curious, skilling, and being open to lifelong learning.</p><p class=\"ql-align-justify\">&nbsp;</p><p class=\"ql-align-justify\">&nbsp;</p><p class=\"ql-align-justify\">&nbsp;</p><p><br></p>",
    "date": "2025-07-25T13:23:14.995Z",
    "media": "/uploads/1753449794964.jpg"
  },
  {
    "id": "1753118148319",
    "content": "<p>Success is not all about winning; it is about the sacrifices one makes to achieve. It is about the number of times one rises after every single fall. Just like the phoenix, it rises from the ashes into a fiery, beautiful, and fierce bird. Failing, on the other hand, is not losing; it is just the First Attempt in Life (FAIL).&nbsp;He has tried countless times, never actually getting what he wanted, but he has never given up.&nbsp;</p><p>Recently, he lost to a Djibouti candidate, Mahmoud Ali Youssou, in the bid for the African Union Commission’s Chairmanship. Raila Amolo Odinga was born on January 7, 1945, at the Anglican Church Missionary Hospital in Maseno, Kisumu District, Nyanza Province. He is the son of Mary Juma Odinga and Jaramogi Oginga Odinga. He is married to Ida Odinga, and they have four children together.</p><p>&nbsp;Raila is a member of the Luo ethnic group. He went to Kisumu Union Primary, Maranda Primary in Bondo, and Maranda High School, where he studied until 1962, when his father transferred him to Germany. He spent the next two years at the Herder Institution, which trained foreign students in the German language and was part of the philological faculty at the University of Leipzig in East Germany. In 1970, he graduated with a certificate in Welding.</p><p>&nbsp;In 1974, Odinga was appointed group standards manager of the Kenya Bureau of Standards. After holding this position for 4 years, he was promoted to deputy director in 1978, a post he held until his 1982 detention. On 1 August 1982, at 3 a.m. on Sunday, a group of soldiers from the Kenya Air Force, led by Senior Private Hezekiah Ochuka, attempted to overthrow the government of the late president Daniel Arap Moi.&nbsp;&nbsp;</p><p>Odinga was arrested and charged with treason after he was accused of being among the masterminds of the 1982 coup. He was released six years later in February 1988, but detained again in August of the same year to be released in June 1989. Later on, Raila joined the Forum for the Restoration of Democracy (FORD), a movement formed to agitate for the return of multi-party democracy to Kenya, which was newly formed, and he was elected the Vice Chairman of the General Purposes Committee of the party.</p><p>Raila has bid for the presidency five times but never succeeded in any of those, but has managed to serve in the capacity of a prime minister during Kibaki’s time – that is, from 2008 to 2013, in what was termed as “nusu mkate”. In his first bid for the presidency in the 1997 General Election, Odinga finished third after President Moi, the incumbent, and Democratic Party candidate Mwai Kibaki. He, however, retained his position as the Langata MP.</p><p>In a surprising move, Odinga decided to support Moi, his arch-enemy, even entering into a political merger between his party, NDP, and Moi’s much-hated KANU party, which many Kenyans likened to the yoke of oppression. The merger was called New KANU. Previous admirers of Odinga now saw him as a sell-out to a cause he had once championed by closing ranks with a despot. He accepted a position in Moi’s cabinet as Energy Minister, serving from June 2001 to 2002, during Moi’s final term.</p><p>Odinga is now renowned for his famous “Handshakes” that have now happened twice, the first was with retired president Uhuru Muigai Kenyatta, which happened in March 2018, which was meant to cool the political temperatures after the 2017 general elections. The Handshake left the then Deputy President William Ruto seeming like he was left out of the government, leading to their fallout with Uhuru Kenyatta. On 7 March 2025, Raila’s Orange Democratic Movement (ODM) signed an MoU to work with the Kenya Kwanza Government led by President William Ruto.</p><p>To date, Odinga still rocks the news and still plays a pivotal role in shaping the political landscape and leadership in Kenya. As earlier said, success is not all about winning; it’s the effort one puts up after failing to acquire the desires of their hearts. We fall but rise stronger. </p>",
    "media": "/uploads/1753216849802.png",
    "date": "2025-07-21T17:15:48.319Z",
    "comments": [],
    "title": "Raila's Struggles to Power",
    "category": "Politics",
    "videoUrl": ""
  }
]